O-H-M2/qmk_port_ch582/qmk_porting/platforms/ch58x/pin_defs.h
/* Copyright 2021 QMK
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#pragma once

#include "CH58x_gpio.h"

#define NO_PIN 0

#define A0  (GPIO_Pin_0)
#define A1  (GPIO_Pin_1)
#define A2  (GPIO_Pin_2)
#define A3  (GPIO_Pin_3)
#define A4  (GPIO_Pin_4)
#define A5  (GPIO_Pin_5)
#define A6  (GPIO_Pin_6)
#define A7  (GPIO_Pin_7)
#define A8  (GPIO_Pin_8)
#define A9  (GPIO_Pin_9)
#define A10 (GPIO_Pin_10)
#define A11 (GPIO_Pin_11)
#define A12 (GPIO_Pin_12)
#define A13 (GPIO_Pin_13)
#define A14 (GPIO_Pin_14)
#define A15 (GPIO_Pin_15)

#define B0  (0x80000000 | GPIO_Pin_0)
#define B1  (0x80000000 | GPIO_Pin_1)
#define B2  (0x80000000 | GPIO_Pin_2)
#define B3  (0x80000000 | GPIO_Pin_3)
#define B4  (0x80000000 | GPIO_Pin_4)
#define B5  (0x80000000 | GPIO_Pin_5)
#define B6  (0x80000000 | GPIO_Pin_6)
#define B7  (0x80000000 | GPIO_Pin_7)
#define B8  (0x80000000 | GPIO_Pin_8)
#define B9  (0x80000000 | GPIO_Pin_9)
#define B10 (0x80000000 | GPIO_Pin_10)
#define B11 (0x80000000 | GPIO_Pin_11)
#define B12 (0x80000000 | GPIO_Pin_12)
#define B13 (0x80000000 | GPIO_Pin_13)
#define B14 (0x80000000 | GPIO_Pin_14)
#define B15 (0x80000000 | GPIO_Pin_15)
#define B16 (0x80000000 | GPIO_Pin_16)
#define B17 (0x80000000 | GPIO_Pin_17)
#define B18 (0x80000000 | GPIO_Pin_18)
#define B19 (0x80000000 | GPIO_Pin_19)
#define B20 (0x80000000 | GPIO_Pin_20)
#define B21 (0x80000000 | GPIO_Pin_21)
#define B22 (0x80000000 | GPIO_Pin_22)
#define B23 (0x80000000 | GPIO_Pin_23)